<details><summary>tf plan:</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.terraform-administrator-in-security.aws_iam_role.terraform-role: Refreshing state... [id=TerraformAdministrativeRole]
module.incident-manage-role-security.data.aws_iam_policy.aws-support-access: Refreshing state...
aws_security_group.default-security: Refreshing state... [id=sg-abaae6d8]
module.incident-manage-role-security.aws_iam_role.aws-incident-manage-role: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport]
module.iam-config-mgt-security.data.aws_iam_policy_document.aws-config-assume-policy: Refreshing state...
module.password-policy-security.aws_iam_account_password_policy.strict: Refreshing state... [id=iam-account-password-policy]
module.incident-manage-role-compliance.aws_iam_role.aws-incident-manage-role: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport]
aws_s3_bucket.log: Refreshing state... [id=cloudtail-bucket-access-log]
aws_kms_key.config-bucket: Refreshing state... [id=e05d5191-9abb-40ea-82c0-f17bcd8f0555]
aws_security_group.default-compliance: Refreshing state... [id=sg-21034f52]
module.iam-config-mgt-compliance.data.aws_iam_policy_document.aws-config-assume-policy: Refreshing state...
module.terraform-administrator-in-compliance.aws_iam_role.terraform-role: Refreshing state... [id=TerraformAdministrativeRole]
aws_kms_key.cloudtrail-bucket: Refreshing state... [id=eefe6618-670c-45de-b5ac-12a63f5c7428]
module.password-policy-compliance.aws_iam_account_password_policy.strict: Refreshing state... [id=iam-account-password-policy]
module.incident-manage-role-compliance.data.aws_iam_policy.aws-support-access: Refreshing state...
module.iam-config-mgt-security.aws_iam_role.config-mgt: Refreshing state... [id=AWSConfigMgtRole]
module.iam-config-mgt-compliance.aws_iam_role.config-mgt: Refreshing state... [id=AWSConfigMgtRole]
module.incident-manage-role-security.aws_iam_role_policy_attachment.this: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport-20200405122435751900000001]
module.incident-manage-role-master.aws_iam_role.aws-incident-manage-role: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport]
aws_kms_key.cloudtrail: Refreshing state... [id=a692c057-48c2-45bd-9751-04c5c27d57e2]
aws_iam_role.org-aggregator: Refreshing state... [id=AWSConfigAggregatorRole]
aws_sns_topic.aws-cis-benchmark: Refreshing state... [id=arn:aws:sns:ap-northeast-1:791325445011:AwsCISBenchmarkAlarm]
aws_iam_role.cloudtrail-servie: Refreshing state... [id=SecureBrigadeCloudTrailServiceRole]
data.aws_iam_policy.administrator-access: Refreshing state...
aws_organizations_organization.org: Refreshing state... [id=o-p0s02sh4yz]
aws_iam_role.azure-sentinel: Refreshing state... [id=AzureSentinelRole]
module.incident-manage-role-master.data.aws_iam_policy.aws-support-access: Refreshing state...
module.iam-config-mgt-master.data.aws_iam_policy_document.aws-config-assume-policy: Refreshing state...
aws_organizations_policy.deny-deleting-security-and-audit-settings: Refreshing state... [id=p-79ctp1iv]
data.aws_organizations_organization.this: Refreshing state...
module.password-policy-master.aws_iam_account_password_policy.strict: Refreshing state... [id=iam-account-password-policy]
aws_organizations_account.security: Refreshing state... [id=085773780922]
aws_security_group.default-master: Refreshing state... [id=sg-4e728f3e]
aws_organizations_account.prod: Refreshing state... [id=806884417180]
aws_organizations_account.stg: Refreshing state... [id=297323088823]
aws_cloudwatch_log_group.cloudtrail: Refreshing state... [id=CloudTrailLogs]
aws_kms_key.terraform-backend: Refreshing state... [id=339c67a9-50ac-4dfb-96cb-719c89bb6d34]
aws_organizations_account.compliance: Refreshing state... [id=491027160565]
data.aws_caller_identity.this: Refreshing state...
data.aws_region.this: Refreshing state...
module.terraform-administrator-in-master.aws_iam_role.terraform-role: Refreshing state... [id=TerraformAdministrativeRole]
module.iam-config-mgt-security.aws_iam_role_policy_attachment.get-config: Refreshing state... [id=AWSConfigMgtRole-20200318162637138100000001]
module.incident-manage-role-compliance.aws_iam_role_policy_attachment.this: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport-20200405122222247100000001]
module.iam-config-mgt-stg.data.aws_iam_policy_document.aws-config-assume-policy: Refreshing state...
module.incident-manage-role-stg.aws_iam_role.aws-incident-manage-role: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport]
aws_security_group.default-stg: Refreshing state... [id=sg-dfade1ac]
module.incident-manage-role-stg.data.aws_iam_policy.aws-support-access: Refreshing state...
module.password-policy-stg.aws_iam_account_password_policy.strict: Refreshing state... [id=iam-account-password-policy]
module.terraform-administrator-in-stg.aws_iam_role.terraform-role: Refreshing state... [id=TerraformAdministrativeRole]
module.iam-config-mgt-compliance.aws_iam_role_policy_attachment.get-config: Refreshing state... [id=AWSConfigMgtRole-20200318162637215400000001]
module.incident-manage-role-prod.aws_iam_role.aws-incident-manage-role: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport]
module.terraform-administrator-in-prod.aws_iam_role.terraform-role: Refreshing state... [id=TerraformAdministrativeRole]
module.password-policy-prod.aws_iam_account_password_policy.strict: Refreshing state... [id=iam-account-password-policy]
aws_security_group.default-prod: Refreshing state... [id=sg-b5afe3c6]
module.iam-config-mgt-prod.data.aws_iam_policy_document.aws-config-assume-policy: Refreshing state...
module.incident-manage-role-prod.data.aws_iam_policy.aws-support-access: Refreshing state...
aws_iam_role_policy_attachment.org-aggregator: Refreshing state... [id=AWSConfigAggregatorRole-20200703185020770100000001]
aws_iam_role_policy_attachment.azure-sentinel: Refreshing state... [id=AzureSentinelRole-20200318170540783200000001]
module.iam-config-mgt-master.aws_iam_role.config-mgt: Refreshing state... [id=AWSConfigMgtRole]
module.incident-manage-role-master.aws_iam_role_policy_attachment.this: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport-20200405122222441800000001]
aws_organizations_policy_attachment.root: Refreshing state... [id=r-kyz3:p-79ctp1iv]
data.aws_iam_policy_document.cloudtrail-log-bucket: Refreshing state...
aws_iam_role_policy.cloudtrail-to-cw-log: Refreshing state... [id=SecureBrigadeCloudTrailServiceRole:SendCloudTrailLogToCloudWatchLogPolicy]
module.iam-config-mgt-stg.aws_iam_role.config-mgt: Refreshing state... [id=AWSConfigMgtRole]
module.incident-manage-role-stg.aws_iam_role_policy_attachment.this: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport-20200405122435872200000001]
module.iam-config-mgt-prod.aws_iam_role.config-mgt: Refreshing state... [id=AWSConfigMgtRole]
aws_sns_topic_subscription.aws-cis-benchmark: Refreshing state... [id=arn:aws:sns:ap-northeast-1:791325445011:AwsCISBenchmarkAlarm:d4f2a103-84fd-4be7-a638-75f3785e4442]
module.terraform-administrator-in-security.aws_iam_role_policy.terraform-role: Refreshing state... [id=TerraformAdministrativeRole:terraform-20200318153422897900000001]
module.terraform-administrator-in-compliance.aws_iam_role_policy.terraform-role: Refreshing state... [id=TerraformAdministrativeRole:terraform-20200318153422938300000001]
module.terraform-administrator-in-prod.aws_iam_role_policy.terraform-role: Refreshing state... [id=TerraformAdministrativeRole:terraform-20200318153422853000000001]
module.terraform-administrator-in-master.aws_iam_role_policy.terraform-role: Refreshing state... [id=TerraformAdministrativeRole:terraform-20200405094353220600000001]
module.terraform-administrator-in-stg.aws_iam_role_policy.terraform-role: Refreshing state... [id=TerraformAdministrativeRole:terraform-20200318153422924700000001]
module.incident-manage-role-prod.aws_iam_role_policy_attachment.this: Refreshing state... [id=AWSIncidentMangeRoleWithAWSSupport-20200405122436024900000001]
module.iam-config-mgt-master.aws_iam_role_policy_attachment.get-config: Refreshing state... [id=AWSConfigMgtRole-20200318162637159000000002]
module.iam-config-mgt-stg.aws_iam_role_policy_attachment.get-config: Refreshing state... [id=AWSConfigMgtRole-20200318162637482100000001]
module.iam-config-mgt-prod.aws_iam_role_policy_attachment.get-config: Refreshing state... [id=AWSConfigMgtRole-20200318162637271900000001]
module.security-group-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.10-SecurityGroupChanges]
module.s3-bucket-policy-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.8-S3BucketPolicyChanges]
module.unauthorized-api-usage-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.1-UnauthorizedAPIUsage]
module.aws-config-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.9-AWSConfigChanges]
module.network-gateway-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.12-NetworkGatewayChanges]
module.iam-policy-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.4-IAMPolicyChanges]
module.root-account-usage-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-1.1-RootAccountUsage]
module.cloudtrail-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.5-CloudTrailChanges]
module.vpc-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.14-VPCChanges]
module.nacl-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.11-NetworkACLChanges]
module.disable-or-delete-cmk-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.7-DisableOrDeleteCMK]
module.console-authentication-failure-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.6-ConsoleAuthenticationFailure]
module.consle-signin-without-mfa-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.2-ConsoleSignInWithoutMFA]
module.route-table-changes-detection.aws_cloudwatch_log_metric_filter.metric-filter: Refreshing state... [id=AWS-CIS-3.13-RouteTableChanges]
aws_kms_alias.cloudtrail-bucket: Refreshing state... [id=alias/cloudTrail-bucket-key]
aws_kms_alias.config-bucket: Refreshing state... [id=alias/config-bucket-key]
aws_s3_bucket.config-bucket: Refreshing state... [id=secure-brigade-aws-config-bucket]
aws_kms_alias.cloudtrail: Refreshing state... [id=alias/cloudTrail-log-key]
module.security-group-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.10-SecurityGroupChanges]
module.s3-bucket-policy-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.8-S3BucketPolicyChanges]
module.unauthorized-api-usage-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.1-UnauthorizedAPIUsage]
module.aws-config-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.9-AWSConfigChanges]
module.network-gateway-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.12-NetworkGatewayChanges]
module.iam-policy-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.4-IAMPolicyChanges]
module.root-account-usage-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-1.1-RootAccountUsage]
module.cloudtrail-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.5-CloudTrailChanges]
aws_s3_bucket.terraform-backend: Refreshing state... [id=secure-brigade-terraform-backend]
aws_kms_alias.terraform-backend: Refreshing state... [id=alias/terraform-backend-key]
module.vpc-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.14-VPCChanges]
module.nacl-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.11-NetworkACLChanges]
module.console-authentication-failure-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.6-ConsoleAuthenticationFailure]
module.disable-or-delete-cmk-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.7-DisableOrDeleteCMK]
module.consle-signin-without-mfa-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.2-ConsoleSignInWithoutMFA]
module.route-table-changes-detection.aws_cloudwatch_metric_alarm.alarm: Refreshing state... [id=AWS-CIS-3.13-RouteTableChanges]
aws_s3_bucket_public_access_block.block-log: Refreshing state... [id=cloudtail-bucket-access-log]
aws_s3_bucket.cloudtrail: Refreshing state... [id=secure-brigade-cloudtrail-log]
module.iam-config-mgt-security.data.aws_iam_policy_document.transfer-record: Refreshing state...
module.iam-config-mgt-master.data.aws_iam_policy_document.transfer-record: Refreshing state...
module.iam-config-mgt-prod.data.aws_iam_policy_document.transfer-record: Refreshing state...
module.iam-config-mgt-compliance.data.aws_iam_policy_document.transfer-record: Refreshing state...
module.iam-config-mgt-stg.data.aws_iam_policy_document.transfer-record: Refreshing state...
module.iam-config-mgt-security.aws_iam_role_policy.transfer-record: Refreshing state... [id=AWSConfigMgtRole:AWSConfigRecordTransferPolicy]
module.iam-config-mgt-master.aws_iam_role_policy.transfer-record: Refreshing state... [id=AWSConfigMgtRole:AWSConfigRecordTransferPolicy]
module.iam-config-mgt-prod.aws_iam_role_policy.transfer-record: Refreshing state... [id=AWSConfigMgtRole:AWSConfigRecordTransferPolicy]
aws_s3_bucket_public_access_block.config-bucket: Refreshing state... [id=secure-brigade-aws-config-bucket]
module.iam-config-mgt-compliance.aws_iam_role_policy.transfer-record: Refreshing state... [id=AWSConfigMgtRole:AWSConfigRecordTransferPolicy]
module.iam-config-mgt-stg.aws_iam_role_policy.transfer-record: Refreshing state... [id=AWSConfigMgtRole:AWSConfigRecordTransferPolicy]
data.aws_iam_policy_document.config-recorder: Refreshing state...
aws_s3_bucket_policy.config-bucket: Refreshing state... [id=secure-brigade-aws-config-bucket]
aws_s3_bucket_public_access_block.block-terraform-backend: Refreshing state... [id=secure-brigade-terraform-backend]
aws_s3_bucket_public_access_block.block-cloudtrail-logging: Refreshing state... [id=secure-brigade-cloudtrail-log]
aws_cloudtrail.master: Refreshing state... [id=cloudtrail-master]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.log will be updated in-place
  ~ resource "aws_s3_bucket" "log" {
        acl                         = "log-delivery-write"
        arn                         = "arn:aws:s3:::cloudtail-bucket-access-log"
        bucket                      = "cloudtail-bucket-access-log"
        bucket_domain_name          = "cloudtail-bucket-access-log.s3.amazonaws.com"
        bucket_regional_domain_name = "cloudtail-bucket-access-log.s3.ap-northeast-1.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z2M4EHUR26P7ZW"
        id                          = "cloudtail-bucket-access-log"
        region                      = "ap-northeast-1"
        request_payer               = "BucketOwner"
        tags                        = {}

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # aws_security_group.default-compliance will be created
  + resource "aws_security_group" "default-compliance" {
      + arn                    = (known after apply)
      + description            = "default VPC security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "default"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.default-master will be created
  + resource "aws_security_group" "default-master" {
      + arn                    = (known after apply)
      + description            = "default VPC security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "default"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.default-prod will be created
  + resource "aws_security_group" "default-prod" {
      + arn                    = (known after apply)
      + description            = "default VPC security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "default"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.default-security will be created
  + resource "aws_security_group" "default-security" {
      + arn                    = (known after apply)
      + description            = "default VPC security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "default"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.default-stg will be created
  + resource "aws_security_group" "default-stg" {
      + arn                    = (known after apply)
      + description            = "default VPC security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "default"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>